// 补充数据，直辖市市级、部分行政区划

// 市级数据
const cities = [
  // 直辖市
  {
    code: "110100",
    name: "北京市",
  },
  {
    code: "310100",
    name: "上海市",
  },
  {
    code: "500100",
    name: "重庆市",
  },
  {
    code: "500200",
    name: "县",
  },
  {
    code: "120100",
    name: "天津市",
  },

  // 直辖县级行政区划
  {
    code: "469000",
    name: "省直辖县级行政区划",
  },
  {
    code: "659000",
    name: "自治区直辖县级行政区划",
  },
  {
    code: "419000",
    name: "省直辖县级行政区划",
  },
  {
    code: "429000",
    name: "省直辖县级行政区划",
  },
];

// 区级数据
const areas = [
  // 海南省三沙市县级行政区
  {
    code: "460321",
    name: "西沙群岛",
  },
  {
    code: "460322",
    name: "南沙群岛",
  },
  {
    code: "460323",
    name: "中沙群岛的岛礁及其海域",
  },

  // 众多省市缺少xxxx01市辖区
  // // 山东省菏泽市市辖区
  // {
  //   code: "371701",
  //   name: "市辖区",
  // },
  // // 河南省郑州市市辖区
  // {
  //   code: "410101",
  //   name: "市辖区",
  // },
];

module.exports = {
  areas,
  cities,
};
